In [3]:
#Object Creation

In [4]:
import numpy as np
import pandas as pd

In [5]:
s=pd.Series([1,2,4,5,np.nan,6,7])
s

0    1.0
1    2.0
2    4.0
3    5.0
4    NaN
5    6.0
6    7.0
dtype: float64

In [6]:
dates=pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df=pd.DataFrame(np.random.randn(6,4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01 -1.443971 -1.264969 -1.514498  0.379825
2013-01-02 -0.297073 -1.698189  0.025104  0.654576
2013-01-03  1.166979  0.132292  0.393677  0.576973
2013-01-04 -1.596401  2.048516  0.003408  1.202181
2013-01-05 -0.981598 -0.917616  1.831406 -1.270526
2013-01-06  0.168124 -1.520638 -1.004770  0.385805

In [8]:
df2=pd.DataFrame(
{
    "A":1.0,
    "B":pd.Timestamp("20130102"),
    "C":pd.Series(1, index=list(range(4)), dtype="float32"),
    "D":np.array([3]*4, dtype="int32"),
    "E":pd.Categorical(["test","train", "test", "train"]),
    "F":"foo"
})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [9]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [10]:
#It is a sunbset of attribute that will be completed

"""In [12]: df2.<TAB>  # noqa: E225, E999
df2.A                  df2.bool
df2.abs                df2.boxplot
df2.add                df2.C
df2.add_prefix         df2.clip
df2.add_suffix         df2.columns
df2.align              df2.copy
df2.all                df2.count
df2.any                df2.combine
df2.append             df2.D
df2.apply              df2.describe
df2.applymap           df2.diff
df2.B                  df2.duplicated"""

'In [12]: df2.<TAB>  # noqa: E225, E999\ndf2.A                  df2.bool\ndf2.abs                df2.boxplot\ndf2.add                df2.C\ndf2.add_prefix         df2.clip\ndf2.add_suffix         df2.columns\ndf2.align              df2.copy\ndf2.all                df2.count\ndf2.any                df2.combine\ndf2.append             df2.D\ndf2.apply              df2.describe\ndf2.applymap           df2.diff\ndf2.B                  df2.duplicated'

In [11]:
#Viewing Data

In [12]:
df.head()

                   A         B         C         D
2013-01-01 -1.443971 -1.264969 -1.514498  0.379825
2013-01-02 -0.297073 -1.698189  0.025104  0.654576
2013-01-03  1.166979  0.132292  0.393677  0.576973
2013-01-04 -1.596401  2.048516  0.003408  1.202181
2013-01-05 -0.981598 -0.917616  1.831406 -1.270526

In [13]:
df.tail()

                   A         B         C         D
2013-01-02 -0.297073 -1.698189  0.025104  0.654576
2013-01-03  1.166979  0.132292  0.393677  0.576973
2013-01-04 -1.596401  2.048516  0.003408  1.202181
2013-01-05 -0.981598 -0.917616  1.831406 -1.270526
2013-01-06  0.168124 -1.520638 -1.004770  0.385805

In [14]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [15]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [16]:
df.to_numpy()

array([[-1.44397134, -1.2649694 , -1.5144982 ,  0.37982515],
       [-0.29707314, -1.69818939,  0.02510446,  0.65457586],
       [ 1.16697878,  0.13229213,  0.39367731,  0.57697349],
       [-1.59640052,  2.04851569,  0.00340762,  1.20218112],
       [-0.98159836, -0.91761591,  1.83140606, -1.27052553],
       [ 0.16812431, -1.52063831, -1.00476998,  0.38580459]])

In [17]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [18]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [19]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.497323 -0.536768 -0.044279  0.321472
std    1.057493  1.422923  1.166291  0.835929
min   -1.596401 -1.698189 -1.514498 -1.270526
25%   -1.328378 -1.456721 -0.752726  0.381320
50%   -0.639336 -1.091293  0.014256  0.481389
75%    0.051825 -0.130185  0.301534  0.635175
max    1.166979  2.048516  1.831406  1.202181

In [20]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.443971   -0.297073    1.166979   -1.596401   -0.981598    0.168124
B   -1.264969   -1.698189    0.132292    2.048516   -0.917616   -1.520638
C   -1.514498    0.025104    0.393677    0.003408    1.831406   -1.004770
D    0.379825    0.654576    0.576973    1.202181   -1.270526    0.385805

In [21]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.379825 -1.514498 -1.264969 -1.443971
2013-01-02  0.654576  0.025104 -1.698189 -0.297073
2013-01-03  0.576973  0.393677  0.132292  1.166979
2013-01-04  1.202181  0.003408  2.048516 -1.596401
2013-01-05 -1.270526  1.831406 -0.917616 -0.981598
2013-01-06  0.385805 -1.004770 -1.520638  0.168124

In [22]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-02 -0.297073 -1.698189  0.025104  0.654576
2013-01-06  0.168124 -1.520638 -1.004770  0.385805
2013-01-01 -1.443971 -1.264969 -1.514498  0.379825
2013-01-05 -0.981598 -0.917616  1.831406 -1.270526
2013-01-03  1.166979  0.132292  0.393677  0.576973
2013-01-04 -1.596401  2.048516  0.003408  1.202181

In [23]:
#Selection

In [24]:
#Getitem []

In [25]:
df["A"]

2013-01-01   -1.443971
2013-01-02   -0.297073
2013-01-03    1.166979
2013-01-04   -1.596401
2013-01-05   -0.981598
2013-01-06    0.168124
Freq: D, Name: A, dtype: float64

In [26]:
df[0:3]

                   A         B         C         D
2013-01-01 -1.443971 -1.264969 -1.514498  0.379825
2013-01-02 -0.297073 -1.698189  0.025104  0.654576
2013-01-03  1.166979  0.132292  0.393677  0.576973

In [27]:
#Selection by levels

In [28]:
df.loc[dates[0]]

A   -1.443971
B   -1.264969
C   -1.514498
D    0.379825
Name: 2013-01-01 00:00:00, dtype: float64

In [29]:
df.loc[:,["A","B"]]

                   A         B
2013-01-01 -1.443971 -1.264969
2013-01-02 -0.297073 -1.698189
2013-01-03  1.166979  0.132292
2013-01-04 -1.596401  2.048516
2013-01-05 -0.981598 -0.917616
2013-01-06  0.168124 -1.520638

In [30]:
df.loc["20130102":"20130104",["A", "B"]]

                   A         B
2013-01-02 -0.297073 -1.698189
2013-01-03  1.166979  0.132292
2013-01-04 -1.596401  2.048516

In [31]:
df.loc[dates[0],"A"]

-1.443971337418897

In [32]:
df.at[dates[0],"A"]

-1.443971337418897

In [33]:
#Selection by position

In [34]:
df.iloc[3]

A   -1.596401
B    2.048516
C    0.003408
D    1.202181
Name: 2013-01-04 00:00:00, dtype: float64

In [35]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -1.596401  2.048516
2013-01-05 -0.981598 -0.917616

In [36]:
df.iloc[[1,2,4], [0,2]]

                   A         C
2013-01-02 -0.297073  0.025104
2013-01-03  1.166979  0.393677
2013-01-05 -0.981598  1.831406

In [37]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.297073 -1.698189  0.025104  0.654576
2013-01-03  1.166979  0.132292  0.393677  0.576973

In [38]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -1.264969 -1.514498
2013-01-02 -1.698189  0.025104
2013-01-03  0.132292  0.393677
2013-01-04  2.048516  0.003408
2013-01-05 -0.917616  1.831406
2013-01-06 -1.520638 -1.004770

In [39]:
df.iloc[1,1]

-1.6981893910857304

In [40]:
df.iat[1,1]

-1.6981893910857304

In [41]:
#Boolen Indexing

In [42]:
df[df>0]

                   A         B         C         D
2013-01-01       NaN       NaN       NaN  0.379825
2013-01-02       NaN       NaN  0.025104  0.654576
2013-01-03  1.166979  0.132292  0.393677  0.576973
2013-01-04       NaN  2.048516  0.003408  1.202181
2013-01-05       NaN       NaN  1.831406       NaN
2013-01-06  0.168124       NaN       NaN  0.385805

In [43]:
df[df["A"]>0]

                   A         B         C         D
2013-01-03  1.166979  0.132292  0.393677  0.576973
2013-01-06  0.168124 -1.520638 -1.004770  0.385805

In [44]:
df2=df.copy()
df2["E"]=["One","One", "Two", "Three", "Four", "Three"]
df2

                   A         B         C         D      E
2013-01-01 -1.443971 -1.264969 -1.514498  0.379825    One
2013-01-02 -0.297073 -1.698189  0.025104  0.654576    One
2013-01-03  1.166979  0.132292  0.393677  0.576973    Two
2013-01-04 -1.596401  2.048516  0.003408  1.202181  Three
2013-01-05 -0.981598 -0.917616  1.831406 -1.270526   Four
2013-01-06  0.168124 -1.520638 -1.004770  0.385805  Three

In [45]:
df2[df2["E"].isin(["Two","Four"])]

                   A         B         C         D     E
2013-01-03  1.166979  0.132292  0.393677  0.576973   Two
2013-01-05 -0.981598 -0.917616  1.831406 -1.270526  Four

In [46]:
#Setting

In [47]:
s1=pd.Series([1,2,3,4,5,6], index=pd.date_range("20130102", periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [48]:
df.at[dates[0], "A"]=0

In [49]:
df.iat[0, 1]=0

In [50]:
df.loc[:, "D"]=np.array([5]* len(df))

In [51]:
df

                   A         B         C    D
2013-01-01  0.000000  0.000000 -1.514498  5.0
2013-01-02 -0.297073 -1.698189  0.025104  5.0
2013-01-03  1.166979  0.132292  0.393677  5.0
2013-01-04 -1.596401  2.048516  0.003408  5.0
2013-01-05 -0.981598 -0.917616  1.831406  5.0
2013-01-06  0.168124 -1.520638 -1.004770  5.0

In [52]:
df2=df.copy()

df2[df2 > 0]= -df2

df2

                   A         B         C    D
2013-01-01  0.000000  0.000000 -1.514498 -5.0
2013-01-02 -0.297073 -1.698189 -0.025104 -5.0
2013-01-03 -1.166979 -0.132292 -0.393677 -5.0
2013-01-04 -1.596401 -2.048516 -0.003408 -5.0
2013-01-05 -0.981598 -0.917616 -1.831406 -5.0
2013-01-06 -0.168124 -1.520638 -1.004770 -5.0

In [53]:
#Missing date

In [54]:
In [55]: df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])

In [56]: df1.loc[dates[0] : dates[1], "E"] = 1

In [57]: df1
Out[57]: 
                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -1.509059  5.0  NaN  1.0
2013-01-02  1.212112 -0.173215  0.119209  5.0  1.0  1.0
2013-01-03 -0.861849 -2.104569 -0.494929  5.0  2.0  NaN
2013-01-04  0.721555 -0.706771 -1.039575  5.0  3.0  NaN

SyntaxError: leading zeros in decimal integer literals are not permitted; use an 0o prefix for octal integers (3640402569.py, line 8)

In [ ]:
df1=df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])

df1.loc[dates[0]: dates[1], "E"]=1

df1

In [ ]:
df1.dropna(how= "any")

In [ ]:
df1.fillna(value=5)

In [ ]:
pd.isna(df1)

In [ ]:
#operations

In [ ]:
#stats

In [ ]:
df.mean()

In [ ]:
df.mean(axis=1)

In [ ]:
s=pd.Series([1,3,5, np.nan, 6,8], index=dates).shift(2)

s

In [ ]:
df.sub(s, axis="index")

In [ ]:
#User Defined Function

In [ ]:
df.agg(lambda x:np.mean(x)*5.6)

In [ ]:
df.transform(lambda x:x*101.2)

In [ ]:
#Value counts

In [ ]:
s=pd.Series(np.random.randint(0,7, size=10))
s

In [ ]:
s.value_counts()

In [ ]:
#String methods

In [ ]:
s=pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA","dog", "cat"])

s.str.lower()

In [ ]:
#merge

In [ ]:
#Concat

In [ ]:
df=pd.DataFrame(np.random.randn(10, 4))
df

In [ ]:
pieces=[df[:3], df[3:7], df[7:1]]
pd.concat(pieces)

In [ ]:
#join

In [ ]:
left=pd.DataFrame({"key": ["foo", "foo"], "lval":[1,2]})

right=pd.DataFrame({"key": ["foo", "foo"], "rval":[4,5]})

In [ ]:
left

In [ ]:
right

In [ ]:
pd.merge(left, right, on="key")

In [ ]:
#Grouping

In [ ]:
df=pd.DataFrame(
{
    "A":["foo", "bar", "foo", "bar", "foo","bar", "foo", "foo"],
    "B":["one", "one", "two", "three", "two", "two", "one", "three"],
    "C":np.random.randn(8),
    "D":np.random.randn(8),
})

df

In [ ]:
df.groupby("A")[["C", "D"]].sum()

In [ ]:
df.groupby(["A", "B"]).sum()

In [ ]:
#Reshaping

In [ ]:
#stack

In [ ]:
arrays=[
    ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
    ["one", "two", "one", "two", "one", "two", "one", "two"],
]


index=pd.MultiIndex.from_arrays(arrays, names=["first", "second"])

df=pd.DataFrame(np.random.randn(8,2), index=index, columns=["A", "B"])

df2=df[:4]

df2

In [ ]:
stacked=df2.stack()

stacked

In [ ]:
stacked.unstack()

In [ ]:
stacked.unstack(0)

In [ ]:
stacked.unstack(1)

In [ ]:
#pivot table

In [ ]:
df = pd.DataFrame(
     {
         "A": ["one", "one", "two", "three"] * 3,
         "B": ["A", "B", "C"] * 4,
         "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
         "D": np.random.randn(12),
         "E": np.random.randn(12),
     }
 )
 
df

In [ ]:
pd.pivot_table(df, values="D", index=["A", "B"], columns="C")

In [ ]:
#Time Series

In [ ]:
rng=pd.date_range("1/1/2012", periods=100, freq="s")


ts=pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

ts.resample("5Min").sum()

In [ ]:
rng=pd.date_range("3/6/2012  00:00", periods=5, freq="D")


ts=pd.Series(np.random.randint(len(rng)), rng)

ts

In [ ]:
ts_utc=ts.tz_localize("UTC")

ts_utc

In [ ]:
ts_utc.tz_convert("US/Eastern")

In [ ]:
rng

In [ ]:
rng + pd.offsets.BusinessDay(5)

In [ ]:
rng + pd.offsets.BusinessDay(5)

In [ ]:
#Categorical

In [ ]:
df = pd.DataFrame(
    {"id": [1, 2, 3, 4, 5, 6], "raw_grade": ["a", "b", "b", "a", "a", "e"]}
)

In [ ]:
df["grade"]=df["raw_grade"].astype("category")

df["grade"]

In [ ]:
new_categories=["Very Good", "Good", "Very Bad"]

df["grade"]=df["grade"].cat.rename_categories(new_categories)

In [ ]:
df["grade"] = df["grade"].cat.set_categories(
 ["very bad", "bad", "medium", "good", "very good"]
)


df["grade"]

In [ ]:
df.sort_values(by="grade")

In [ ]:
df.groupby("grade", observed= False).size()

In [ ]:
#Plotting

In [ ]:
import matplotlib.pyplot as plt
plt.close("all")

In [ ]:
ts= pd.Series(np.random.randn(1000), index=pd.date_range("1/1/2000", periods=1000))

ts=ts.cumsum()

ts.plot()

In [ ]:
df=pd.DataFrame(
np.random.randn(1000, 4), index=ts.index, columns=["A", "B", "C", "D"])

df=df.cumsum()

plt.figure()

df.plot()

plt.legend(loc="best")

In [ ]:
#Importing and Exporting CSV

In [ ]:
#Writing a csv file

In [ ]:
df=pd.DataFrame(np.random.randint(0,5,(10, 5)))

df.to_csv("foo.csv")

In [ ]:
#Reading a csv

In [ ]:
pd.read_csv("foo.csv")

In [ ]:
#praquet

In [ ]:
df.to_parquet("foo.parquet")

In [ ]:
pd.read_parquet("foo.parquet")

In [ ]:
#Excel

In [55]:
df.to_excel("foo.xlsx", sheet_name="Sheet1")

In [56]:
pd.read_excel("foo.xlsx", "Sheet1", index_col=None, na_values=["NA"])

  Unnamed: 0         A         B         C  D
0 2013-01-01  0.000000  0.000000 -1.514498  5
1 2013-01-02 -0.297073 -1.698189  0.025104  5
2 2013-01-03  1.166979  0.132292  0.393677  5
3 2013-01-04 -1.596401  2.048516  0.003408  5
4 2013-01-05 -0.981598 -0.917616  1.831406  5
5 2013-01-06  0.168124 -1.520638 -1.004770  5